Show / Hide Table of Contents
Enum ShearMethod
Method of shear calculation
Namespace: IdeaRS.OpenModel.Concrete.CheckResult
Assembly: IdeaRS.OpenModel.dll
Syntax
public enum ShearMethod
Fields
 Name |  Description
 MethodJoints
method according 6.2.5(1)
 MethodVrdcCracked
method according 6.2.2.1
 MethodVrdcGeneralHcs
method according EN1168
 MethodVrdcPlain
method according 12.6.3
 MethodVrdcPrestress
method according 6.2.2.2
 MethodVrdcSimpleHcs
method according 6.2.2.2
 MethodVrds
method according 6.2.3.3
 NoDefined
not defined
 Improve this Doc
 View Source